hackathon/src/InformationRegisters/ОповещенияПользователей/ОповещенияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователей</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

hackathon/src/CommonModules/ОповещенияСервер/Module.bsl
// Создать запись оповещения в регистре
Процедура СоздатьОповещение(Пользователь, Заголовок, Текст, Объект, УникальныйКлюч) Экспорт
    
    НавигационнаяСсылка = "";
    Если ЗначениеЗаполнено(Объект) Тогда
        НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект);
    КонецЕсли;
    
    НаборЗаписей = РегистрыСведений.ОповещенияПользователей.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
    НаборЗаписей.Отбор.ВремяСобытия.Установить(ТекущаяДатаСеанса());
    НаборЗаписей.Отбор.УникальныйКлюч.Установить(УникальныйКлюч);
    
    Запись = НаборЗаписей.Добавить();
    Запись.Пользователь = Пользователь;
    Запись.ВремяСобытия = ТекущаяДатаСеанса();
    Запись.УникальныйКлюч = УникальныйКлюч;
    Запись.Заголовок = Заголовок;
    Запись.ТекстОповещения = Текст;
    Запись.НавигационнаяСсылка = НавигационнаяСсылка;
    Запись.ИсточникОбъект = Объект;
    Запись.Прочитано = Ложь;
    
    НаборЗаписей.Записать();
    
КонецПроцедуры

// Получить непрочитанные оповещения текущего пользователя
Функция ПолучитьНепрочитанныеОповещения() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ОповещенияПользователей.Пользователь КАК Пользователь,
    |    ОповещенияПользователей.ВремяСобытия КАК ВремяСобытия,
    |    ОповещенияПользователей.УникальныйКлюч КАК УникальныйКлюч,
    |    ОповещенияПользователей.Заголовок КАК Заголовок,
    |    ОповещенияПользователей.ТекстОповещения КАК ТекстОповещения,
    |    ОповещенияПользователей.НавигационнаяСсылка КАК НавигационнаяСсылка,
    |    ОповещенияПользователей.ИсточникОбъект КАК ИсточникОбъект
    |ИЗ
    |    РегистрСведений.ОповещенияПользователей КАК ОповещенияПользователей
    |ГДЕ
    |    ОповещенияПользователей.Пользователь = &Пользователь
    |    И ОповещенияПользователей.Прочитано = ЛОЖЬ
    |
    |УПОРЯДОЧИТЬ ПО
    |    ВремяСобытия";
    
    Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
    
    ТаблицаОповещений = Запрос.Выполнить().Выгрузить();
    
    // ПРЕОБРАЗУЕМ ТаблицуЗначений в Массив структур
    МассивОповещений = Новый Массив;
    
    Для Каждого Строка Из ТаблицаОповещений Цикл
        
        Оповещение = Новый Структура;
        Оповещение.Вставить("Пользователь", Строка.Пользователь);
        Оповещение.Вставить("ВремяСобытия", Строка.ВремяСобытия);
        Оповещение.Вставить("УникальныйКлюч", Строка.УникальныйКлюч);
        Оповещение.Вставить("Заголовок", Строка.Заголовок);
        Оповещение.Вставить("ТекстОповещения", Строка.ТекстОповещения);
        Оповещение.Вставить("НавигационнаяСсылка", Строка.НавигационнаяСсылка);
        Оповещение.Вставить("ИсточникОбъект", Строка.ИсточникОбъект);
        
        МассивОповещений.Добавить(Оповещение);
        
    КонецЦикла;
    
    // Возвращаем МАССИВ, а не ТаблицуЗначений!
    Возврат МассивОповещений;
    
КонецФункции

// Отметить оповещение как прочитанное
Процедура ОтметитьКакПрочитанное(Пользователь, ВремяСобытия, УникальныйКлюч) Экспорт
    
    НаборЗаписей = РегистрыСведений.ОповещенияПользователей.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
    НаборЗаписей.Отбор.ВремяСобытия.Установить(ВремяСобытия);
    НаборЗаписей.Отбор.УникальныйКлюч.Установить(УникальныйКлюч);
    НаборЗаписей.Прочитать();
    
    Если НаборЗаписей.Количество() > 0 Тогда
        НаборЗаписей[0].Прочитано = Истина;
        НаборЗаписей.Записать();
    КонецЕсли;
    
КонецПроцедуры

// Обработчик подписки на событие записи обращения
Процедура СоздатьОповещениеПриЗаписиОбращения(Источник, Отказ) Экспорт
    
    Если Источник.ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(Источник.Исполнитель) Тогда
        Возврат;
    КонецЕсли;
    
    СоздаватьОповещение = Ложь;
    
    Если Источник.ЭтоНовый() Тогда
        СоздаватьОповещение = Истина;
    Иначе
        СтарыйИсполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "Исполнитель");
        Если СтарыйИсполнитель <> Источник.Исполнитель Тогда
            СоздаватьОповещение = Истина;
        КонецЕсли;
    КонецЕсли;
    
    Если СоздаватьОповещение Тогда
        
        Заголовок = "Новое обращение!";
        
        Текст = СтрШаблон(
            "Вам назначено обращение №%1. Приоритет: %2, Статус: %3",
            Источник.Наименование,
            Источник.Приоритет,
            Источник.Статус
        );
        
        УникальныйКлюч = "Обращение_" + Строка(Источник.Ссылка);
        
        СоздатьОповещение(
            Источник.Исполнитель,
            Заголовок,
            Текст,
            Источник.Ссылка,
            УникальныйКлюч
        );
        
    КонецЕсли;
    
КонецПроцедуры
